import 'dotenv/config';
import { PrismaClient } from '@prisma/client';

const prisma = new PrismaClient();

async function main() {
  try {
    await prisma.place.createMany({
      data: [
        { name: 'เพลาเพลิน', category: 'Attraction', image: '/images/เพลาเพลิน.jpg', description: ' เค้ามีที่พักและสปาเด็ดๆ ให้ใช้บริการกันด้วยนะ รับรองว่าสายชิลล์แฮปปี้กันแy' },
        { name: 'ศาลหลักเมืองบุรีรัมย์', category: 'Attraction', image: '/images/ศาลหลักเมืองบุรีรัมย์.jpg', description: 'ความพิเศษของที่นี่ก็คือการมีเสาหลักเมืองให้สักการะกันถึงสองต้นเลยนะ ต้นแรกนั้นสันนิษฐานว่าสร้างขึ้นเมื่อครั้งรัชกาลที่ 1 ' },
        { name: 'วนอุทยานภูเขาไฟกระโดง', category: 'Attraction', image: '/images/วนอุทยานภูเขาไฟกระโดง.jpg', description: 'ต่อกันที่วนอุทยานภูเขาไฟกระโดง ' },
        { name: 'อ่างเก็บน้ำห้วยจระเข้มาก', category: 'Attraction', image: '/images/อ่างเก็บน้ำห้วยจระเข้มาก.jpg', description: 'เพราะเป็นทะเลสาบน้ำจืดขนาดใหญ่ที่อยู่ไม่ไกลจากใจกลางเมืองเท่าไหร่นัก ในช่วงฤดูหนาวจะมีนกอพยพสารพัดสายพันธุ์ให้ได้เห็นกัน ' },
        { name: 'อุทยานประวัติศาสตร์เขาพนมรุ้ง', category: 'Attraction', image: '/images/อุทยานประวัติศาสตร์เขาพนมรุ้ง.jpg', description: 'นี่คือพิกัดที่อยากชวนให้ออกสตาร์ทมาเยือนกันตั้งแต่เช้าหน่อยนะ เพราะอากาศจะสบายๆ แถมแดดก็ยังไม่ร้อนเกินไปเหมาะกับการมาเดินชมกัน ' },
        { name: 'ปราสาทเมืองต่ำ', category: 'Attraction', image: '/images/ปราสาทเมืองต่ำ.jpg', description: 'ปราสาทเมืองต่ำ เป็นพิกัดที่ไม่ไกลจากปราสาทหินพนมรุ้งเท่าไหร่นัก แต่ก็น่าปักหมุดไม่แพ้กันเลยเชียวละ' },
        { name: 'ลูกชิ้นยืนกิน', category: 'Attraction', image: '/images/ลูกชิ้นยืนกิน.jpg', description: 'เข้าเมืองมาช่วงบ่ายๆ ก็ต้องแวะไปโดนอีกหนึ่งไฮไลท์มาแรงของบุรีรัมย์เค้าหน่อยละ นาทีนี้มาที่นี่แล้วไม่ได้แวะชิมลูกชิ้นยืนกินหน้าสถานีรถไฟของโปรดในดวงใจของสาวลิซ่า ' },
        { name: 'วัดเขาพระอังคาร', category: 'Attraction', image: '/images/วัดเขาพระอังคาร.jpg', description: 'อีกหนึ่งวัดที่ภูมิใจนำเสนอและอยากชวนให้มาแวะกันก็คือวัดเขาพระอังคารนี่ละ วัดนี้สร้างขึ้นบนบริเวณภูเขาไฟซึ่งมีลักษณะคล้ายพญาครุฑนอนคว่ำหน้า' },
        { name: 'ผ้าย้อมดินภูอัคนี บ้านเจริญสุข', category: 'Attraction', image: '/images/ผ้าย้อมดินภูอัคนี บ้านเจริญสุข.jpg', description: 'เป็นที่ตั้งของหมู่บ้านเจริญสุข ซึ่งเป็นพิกัดที่เราอยากให้ปักหมุดไว้เลยจ้า ' },

        { name: 'ซันเบค, บุรีรัมย์', category: 'Restaurant', image: '/images/ซันเบค, บุรีรัมย์.jpg', description: 'คาเฟ่บุรีรัมย์เปิดใหม่อย่าง SUNBAKED คาเฟ่ดีไซน์สวย ตัวร้านอยู่ห่างจากซอยข้างบิ๊กซีบุรีรัมย์ 800 เมตร หรือ 1.5 กิโลเมตร จากซอยข้างสนามช้างอารีน่า ' },
        { name: 'อันบ็อกซ์ โปรเจค', category: 'Restaurant', image: '/images/อันบ็อกซ์ โปรเจค.jpg', description: 'UNBOX.PROJECT ใครมาเที่ยวบุรีรัมย์ต้องแวะมาให้ได้เลย ตัวร้าน 2 ชั้นสีขาวที่ตัดกับวัสดุไม้และเฟอร์นิเจอร์ไม้สีน้ำตาลพอเปิดประตูร้านเข้าไปคือบรรยากาศดีมากภายในร้านอบอวลไปด้วยความอบอุ่น' },
        { name: 'เลิฟอีส คาเฟ่', category: 'Restaurant', image: '/images/เลิฟอีส คาเฟ่.jpg', description: 'Loveis Cafe คาเฟ่สไตล์โดดเด่นเป็นไม้ทั้งหมดไม่ว่าจะเป็นตัวร้านจนหรือแม้กระทั่งเฟอร์นิเจอร์ของตกแต่งภายในร้านส่วนใหญ่ก็จะเป็นไม้ทั้งหมด ฟีลของร้านเรียบแต่หรูดูมีสไตล์สุดๆ ' },
        { name: 'อะเฮ้าส์ คาเฟ่', category: 'Restaurant', image: '/images/อะเฮ้าส์ คาเฟ่.jpg', description: 'A HAUS cafe คาเฟ่สุดชิคในจังหวัดบุรีรัมย์แค่เห็นหน้าร้านก็รู้สึกว้าวแล้วเพราะว่ากระจกใสเยอะมากถ้าเข้าไปด้านในแล้วบอกเลยว่าฟีลดีมาก' },
        { name: 'การ์เด้นแกลมปิ้ง คาเฟ่ แอนด์ อีทเทอรี', category: 'Restaurant', image: '/images/การ์เด้นแกลมปิ้ง คาเฟ่ แอนด์ อีทเทอรี.jpg', description: 'คาเฟ่บุรีรัมย์สไตล์แคมป์ปิ้งสุดชิลล์ที่น่าไปเช็คอินแบบสุดๆ ทางร้านก็มีให้เลือกนะว่าเราจะนั่งในร้านโซนอินดอร์หรือจะออกไปชิลล์ดื่มด่ำบรรยากาศเมาท์มอยกับแก๊งค์เพื่อน' },
        
        { name: 'กรีน แอท บุรีรัมย์', category: 'Hotel', image: '/images/กรีน แอท บุรีรัมย์.png', description: 'บูติคโฮเทลสไตล์ธรรมชาติ ใจกลางเมืองบุรีรัมย์ ได้แนวคิดมาจากต้นไม้สีเขียว ท้องฟ้าสีคราม และสายน้ำ คือ การอยู่ร่วมกับธรรมชาติ ในโรงแรมบรรยากาศดี เงียบสงบ ร่มรื่นไปด้วยต้นไม้' },
        { name: 'โรงแรม เดอะ เซอร์เคิล', category: 'Hotel', image: '/images/โรงแรม เดอะ เซอร์เคิล.png', description: 'โรงแรมทำเลดี ไปไหนมาไหนง่าย เดินทางสะดวก ตั้งอยู่แถววงเวียน ร.1 ใกล้เซเว่น ร้านอาหาร และคาเฟ่หลายร้าน หาของกินได้เลย ตัวโรงแรมเป็นอาคารสูง 4 ชั้น สีขาว-ส้ม ดีไซน์โมเดิร์น' },
        { name: 'โรงแรมบุรีเทล', category: 'Hotel', image: '/images/โรงแรมบุรีเทล.png', description: 'บุรีเทล โรงแรมสวยบนถนนหาญชนะ ตั้งอยู่ใจกลางเมือง เดินทางสะดวก ไปยังสถานที่ต่างๆ ได้ง่าย ทั้งสนามฟุตบอลช้างอารีน่าและสนามแข่งขันช้างอินเตอร์เนชั่นแนลเซอร์กิต บรรยากาศเงียบสงบ มีความเป็นส่วนตัว' },
        { name: 'โรงแรมคู', category: 'Hotel', image: '/images/โรงแรมคู.png', description: 'โรงแรมคู ทำเลใกล้บขส., มหาวิทยาลัยราชภัฏบุรีรัมย์ และวิทยาลัยเทคนิคบุรีรัมย์ ตั้งอยู่ใจกลางเมือง รอบๆ มีร้านค้าร้านอาหารมากมาย ตัวอาคารสูง 5 ชั้น ทันสมัย ตกแต่งหลากสไตล์' },
        { name: 'โรงแรมเรย์', category: 'Hotel', image: '/images/โรงแรมเรย์.png', description: 'ไม่ไกลจากใจกลางเมือง เดินทางสะดวก บรรยากาศดี เงียสงบ ดีไซน์ทันสมัย ตกแต่งอย่างลงตัว บริการห้องพัก มีให้เลือกหลายแบบ มีห้องสำหรับครอบครัวรองรับ ภายในห้องสะอาด สะดวกสบาย กว้างขวาง' },

        // Add more data...

      ],
    });

    console.log('Seed data added successfully');
  } catch (error) {
    console.error('Error seeding data:', error);
    process.exit(1);
  } finally {
    await prisma.$disconnect();
  }
}

main();
